# Terminal
cask "ghostty"
brew "tmux"
brew "starship"
brew "sheldon"
brew "zoxide"
brew "fzf"

# File manager
brew "yazi"
brew "ffmpeg"       # video thumbnails
brew "sevenzip"     # archive extraction/preview
brew "jq"           # JSON preview
brew "poppler"      # PDF preview
brew "fd"           # file searching
brew "ripgrep"      # file content searching
brew "resvg"        # SVG preview
brew "imagemagick"  # Font/HEIC/JPEG XL preview

# Fonts
cask "font-hack-nerd-font"

# Dev tools
brew "mise"
